---
title: BumpMap
classe: Autodesk.Revit.DB.Visual.BumpMap
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 14
---

# BumpMap

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String BumpmapBitmap { get; }` | `BumpMap.BumpmapBitmap` | String |
| `String BumpmapDepth { get; }` | `BumpMap.BumpmapDepth` | String |
| `String BumpmapNormalScale { get; }` | `BumpMap.BumpmapNormalScale` | String |
| `String BumpmapType { get; }` | `BumpMap.BumpmapType` | String |
| `String TextureLinkTextureTransforms { get; }` | `BumpMap.TextureLinkTextureTransforms` | String |
| `String TextureOffsetLock { get; }` | `BumpMap.TextureOffsetLock` | String |
| `String TextureRealWorldOffsetX { get; }` | `BumpMap.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `BumpMap.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldScaleX { get; }` | `BumpMap.TextureRealWorldScaleX` | String |
| `String TextureRealWorldScaleY { get; }` | `BumpMap.TextureRealWorldScaleY` | String |
| `String TextureScaleLock { get; }` | `BumpMap.TextureScaleLock` | String |
| `String TextureURepeat { get; }` | `BumpMap.TextureURepeat` | String |
| `String TextureVRepeat { get; }` | `BumpMap.TextureVRepeat` | String |
| `String TextureWAngle { get; }` | `BumpMap.TextureWAngle` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```